import json
import sys
from datetime import datetime
from pathlib import Path
from sqlalchemy.orm import Session

BASE_DIR = Path(__file__).parent
EMAILS_PATH = BASE_DIR.parent / "Data" / "email.json"
FILTERS_PATH = BASE_DIR / "filters_words.json"

sys.path.append(str(BASE_DIR.parent / "Data"))
from database import Email, Statistic, engine


def load_filters():#--------------------------------------------------------просто возвращает список фильтров из файла filters_jwords.json 
    with open(FILTERS_PATH, encoding="utf-8") as f:
        return json.load(f)


def check_email(text, filters):#--------------------------------------------принимает текст и филтр(load_filter)
    text_lower = text.lower()#----------------------------------------------нижний регистр чтобы большие буквы не имели значение, и зачем я трачу время на описнаие этого..
    score = 0#--------------------------------------------------------------запишем сюда результат 
    for rule in filters:#---------------------------------------------------перебор всех фильров
        for p in rule["patterns"]:#-----------------------------------------перебираем ключевые бан слова
            if p.lower() in text_lower:#------------------------------------если совпало слово с бан словом то
                score += rule["score"]#-------------------------------------счетчик спама увеличивается
    return score


def get_reasons(text, filters):#--------------------------------------------по факту тоже самое что и check email 
    text_lower = text.lower()#----------------------------------------------нижний регистр
    reasons = []#-----------------------------------------------------------тут будут храниться причины обвинения в бане
    for rule in filters:#---------------------------------------------------перебираем все фильтры из  filters_words.json
        for p in rule["patterns"]:#-----------------------------------------перебираем все причины обвинения
            if p.lower() in text_lower:#------------------------------------если слово равно того что из бана то
                reasons.append(rule["reason"])#-----------------------------добавляем причину обвинения
                break#------------------------------------------------------переходим к следуйщему фильтру чтобы случайно не записывать одну и ту же причину
    return "; ".join(reasons)#----------------------------------------------склеиваем весь список причин обвинения в строку с ; 


def get_all_emails():#------------------------------------------------------получаем весь список Email из бд
    session = Session(engine)#----------------------------------------------открываем сесию для обращения к бд
    emails = session.query(Email).all()#------------------------------------получаем все элементы табицы Email
    session.close()#--------------------------------------------------------закрываем сесию потому что мы уже получили что нужно от сесии
    result = []#------------------------------------------------------------контейнер в который мы запишем все элементы 
    for e in emails:#-------------------------------------------------------перебираем все элементы
        result.append({#----------------------------------------------------записываем
            "id": e.id,
            "sender": e.sender,
            "text": e.text,
            "classification": e.classification,
            "confidence": e.confidence,
            "reasons": e.reasons,
        })

    return result


def find_by_sender(sender):#-----------------------------------------------Посик сообщений по имейду пользователя
    session = Session(engine)#---------------------------------------------открыаем сесию для получения информации с бд
    emails = session.query(Email).filter(Email.sender == sender).all()#----получаем список из таюлицы Email с филтром по названию почты
    session.close()#-------------------------------------------------------закрываем сесию так как мы получили список 
    if not emails:#--------------------------------------------------------проверка, если нету записей с таким имейлом 
        return None#-------------------------------------------------------то вохвращаем нон
    messages = []#---------------------------------------------------------список для сообщений
    total_score = 0#-------------------------------------------------------сумма всех оценок спама
    for e in emails:#------------------------------------------------------перебираем весь список
        messages.append(e.text)#-------------------------------------------добавляем текст пользователя в наш масив
        total_score += e.confidence#---------------------------------------увеличиваем количество спам бала
    return {#--------------------------------------------------------------возвращаем результат
        "sender": sender,#-------------------------------------------------имейл который мы и так передали но пускай будет 
        "messages": messages,#---------------------------------------------масив всех сообщений
        "avg_score": total_score / len(messages),#-------------------------средний спам бал за все сообщений от пользователя с такой почтой
    }


def create_email(sender, text):#-------------------------------------------функция записи в таблицу Email
    filters = load_filters()#----------------------------------------------добавляем филтры спама, возвращает информацию из json файла для:
    score = check_email(text, filters)#------------------------------------получения оценки спама
    reasons = get_reasons(text, filters)#----------------------------------получения обвинения
    if score <= 15:#-------------------------------------------------------клафикиция по балам спама
        classification = "вероятно без спама"
    elif score <= 25:
        classification = "вероятно спам"
    else:
        classification = "спам"#
    email = Email(#--------------------------------------------------------создаем обьяект для записи в бд
        sender=sender,
        text=text,
        classification=classification,
        confidence=score,
        reasons=reasons,
    )
    session = Session(engine)#----------------------------------------------открываем сесию для записи в бд
    session.add(email)#-----------------------------------------------------делаем запись в бд
    session.commit()#-------------------------------------------------------сохраняем изменения
    session.refresh(email)#-------------------------------------------------на свякий случай
    session.close()#--------------------------------------------------------закрываем сесию
        return email#-------------------------------------------------------влзвращаем резульятат

def rate_email(email_id, my_score):#----------------------------------------фуекция для оценки сообщения из бд Email, email_id это то айди записи в таблице email
    session = Session(engine)#----------------------------------------------открываем сесию для работы с бд
    email = session.get(Email, email_id)#-----------------------------------находим елемент с бд Email по айди
    if email is None:#------------------------------------------------------если не найдено хотя бв одного элемента с таким айди то нон
        session.close()
        return None
    stat = Statistic(#------------------------------------------------------записываем все в обьект
        sender=email.sender,
        text=email.text,
        scores=my_score,
        created_at=email.created_at,
    )
    session.add(stat)#------------------------------------------------------добавляем елемент в бд
    session.commit()#-------------------------------------------------------сохраняем изменения в бд
    session.refresh(stat)#--------------------------------------------------на свякий пожарный
    session.close()#--------------------------------------------------------закрываем сесию работы с бд
    return stat

def avg_user_score():#------------------------------------------------------средняя оценка успешности бд по балам с таюлицы статистикс
    session = Session(engine)#----------------------------------------------открываем сесию для работы с бд
    result = session.query(Statistic.scores).all()#-------------------------получаем список всех оценок от пользователей
    session.close()#--------------------------------------------------------закрываем сесию работы с бд
    if not result:#---------------------------------------------------------если пусто то возвражаем ничего
        return None
    total = 0#--------------------------------------------------------------тут будет сумма балов
    for row in result:#-----------------------------------------------------перебираем все едементы для сумы
        total += row[0]
    count = len(result)#----------------------------------------------------получаем общее количество
    average = total / count#------------------------------------------------среедний бал, все балый/количество
return average

def load_emails_to_db():#---------------------------------------------------просто дублирует 
    filters = load_filters()
    with open(EMAILS_PATH, encoding="utf-8") as f:
        emails = json.load(f)
    with Session(engine) as session:
        for e in emails:
            score = check_email(e["text"], filters)
            reasons = get_reasons(e["text"], filters)
            if score <= 15:
                classification = "вероятно без спама"
            elif score <= 25:
                classification = "вероятно спам"
            else:
                classification = "спам"
            session.add(Email(
                sender=e["sender"],
                text=e["text"],
                time=datetime.fromisoformat(e["time"]),
                classification=classification,
                confidence=score,
                reasons=reasons,
            ))
        session.commit()
    return len(emails)